{"backend": "tensorflow", "config": [{"config": {"use_bias": true, "activation": "linear", "batch_input_shape": [null, 3001, 1], "dtype": "float32", "strides": [1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "filters": 64, "kernel_size": [3], "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "name": "conv1d_103"}, "class_name": "Conv1D"}, {"config": {"gamma_regularizer": null, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "scale": true, "momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "name": "batch_normalization_47"}, "class_name": "BatchNormalization"}, {"config": {"strides": [3], "trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_67"}, "class_name": "MaxPooling1D"}, {"config": {"rate": 0.20090552210103232, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_253"}, "class_name": "Dropout"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_303"}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "flatten_51"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_251"}, "class_name": "Dense"}, {"config": {"rate": 0.0019689793061075656, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_254"}, "class_name": "Dropout"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_304"}, "class_name": "PReLU"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_252"}, "class_name": "Dense"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_305"}, "class_name": "PReLU"}, {"config": {"rate": 0.0019689793061075656, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_255"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_253"}, "class_name": "Dense"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_306"}, "class_name": "PReLU"}, {"config": {"rate": 0.0019689793061075656, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_256"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_254"}, "class_name": "Dense"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_307"}, "class_name": "PReLU"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_255"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3"}