{"config": [{"config": {"bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dilation_rate": [1], "filters": 32, "padding": "valid", "activity_regularizer": null, "kernel_size": [11], "batch_input_shape": [null, 4000, 1], "dtype": "float32", "strides": [1], "use_bias": true, "name": "conv1d_69", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_69", "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling1d_25", "trainable": true, "strides": [1], "padding": "valid", "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_73", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_89", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.09751613533060369}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "padding": "valid", "activity_regularizer": null, "kernel_size": [11], "trainable": true, "strides": [1], "use_bias": true, "name": "conv1d_70", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_70", "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling1d_26", "trainable": true, "strides": [1], "padding": "valid", "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_74", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_90", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.09751613533060369}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "padding": "valid", "activity_regularizer": null, "kernel_size": [11], "trainable": true, "strides": [1], "use_bias": true, "name": "conv1d_71", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_71", "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling1d_27", "trainable": true, "strides": [1], "padding": "valid", "pool_size": [2]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_75", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_91", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.09751613533060369}, "class_name": "Dropout"}, {"config": {"name": "flatten_21", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "units": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_101", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_76", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_92", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.09751613533060369}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 32, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_102", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_77", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "units": 16, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_103", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_78", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "units": 8, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_104", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "name": "p_re_lu_79", "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_105", "activation": "sigmoid", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}