{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"batch_input_shape": [null, 3001, 1], "filters": 64, "strides": [1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [9], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_106", "use_bias": true, "dtype": "float32", "padding": "valid", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_66", "trainable": true, "beta_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "strides": [3], "name": "max_pooling1d_65", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_256", "rate": 0.05942883954017292, "trainable": true, "noise_shape": null}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_constraint": null, "shared_axes": null, "name": "p_re_lu_306", "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Flatten", "config": {"name": "flatten_51", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_251", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_257", "rate": 0.11769090174805524, "trainable": true, "noise_shape": null}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_constraint": null, "shared_axes": null, "name": "p_re_lu_307", "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_252", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_constraint": null, "shared_axes": null, "name": "p_re_lu_308", "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_258", "rate": 0.11769090174805524, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_253", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_constraint": null, "shared_axes": null, "name": "p_re_lu_309", "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_259", "rate": 0.11769090174805524, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_254", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "PReLU", "config": {"trainable": true, "alpha_constraint": null, "shared_axes": null, "name": "p_re_lu_310", "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_255", "activation": "sigmoid", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}