{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "dilation_rate": [1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 16, "activation": "linear", "name": "conv1d_104", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3], "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "padding": "valid", "bias_regularizer": null, "use_bias": true, "trainable": true, "batch_input_shape": [null, 1001, 1], "activity_regularizer": null, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "name": "batch_normalization_36", "momentum": 0.99, "beta_constraint": null, "center": true, "trainable": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "average_pooling1d_76", "padding": "valid", "pool_size": [2], "strides": [2]}, "class_name": "AveragePooling1D"}, {"config": {"trainable": true, "name": "dropout_254", "seed": null, "rate": 0.34800464161229017, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_304", "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_constraint": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "flatten_51"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "name": "dense_251", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_255", "seed": null, "rate": 0.006246559960600473, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_305", "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_constraint": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "name": "dense_252", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_306", "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_constraint": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "dropout_256", "seed": null, "rate": 0.006246559960600473, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "name": "dense_253", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_307", "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_constraint": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "dropout_257", "seed": null, "rate": 0.006246559960600473, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null, "name": "dense_254", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_308", "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_constraint": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_regularizer": null, "name": "dense_255", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}