{"config": [{"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_size": [5], "activation": "linear", "dtype": "float32", "kernel_constraint": null, "strides": [1], "name": "conv1d_1", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "batch_input_shape": [null, 2001, 1], "filters": 128}, "class_name": "Conv1D"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "pool_size": [3], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.08625213973083698}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_1", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_size": [5], "activation": "linear", "strides": [1], "kernel_constraint": null, "filters": 128, "name": "conv1d_2", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling1d_2", "padding": "valid", "trainable": true, "pool_size": [3], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.08625213973083698}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_2", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2650803877994672}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_3", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "units": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_4", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2650803877994672}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "units": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_5", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"name": "dropout_5", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.2650803877994672}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_4", "units": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_6", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "trainable": true}, "class_name": "PReLU"}, {"config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_5", "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential"}