{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"batch_input_shape": [null, 4000, 1], "filters": 32, "trainable": true, "kernel_size": [9], "name": "conv1d_156", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "strides": [1], "dtype": "float32", "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_71", "momentum": 0.99, "beta_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "padding": "valid", "trainable": true, "name": "max_pooling1d_91"}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_356", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.6511477878147395, "trainable": true, "name": "dropout_206"}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "filters": 32, "trainable": true, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv1d_157", "strides": [1], "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_72", "momentum": 0.99, "beta_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "padding": "valid", "trainable": true, "name": "max_pooling1d_92"}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_357", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.6511477878147395, "trainable": true, "name": "dropout_207"}}, {"class_name": "Conv1D", "config": {"kernel_size": [9], "filters": 32, "trainable": true, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "conv1d_158", "strides": [1], "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "batch_normalization_73", "momentum": 0.99, "beta_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "scale": true, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "padding": "valid", "trainable": true, "name": "max_pooling1d_93"}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_358", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.6511477878147395, "trainable": true, "name": "dropout_208"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_51"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_251", "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_359", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.6511477878147395, "trainable": true, "name": "dropout_209"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_252", "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_360", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_253", "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_361", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_254", "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null, "trainable": true, "name": "p_re_lu_362", "alpha_constraint": null, "alpha_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "name": "dense_255", "bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}