{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"batch_input_shape": [null, 180, 1], "filters": 16, "strides": [1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "trainable": true, "dtype": "float32", "activation": "linear", "dilation_rate": [1], "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "center": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_1", "strides": [2], "padding": "valid", "pool_size": [2]}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"filters": 16, "strides": [1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "trainable": true, "dilation_rate": [1], "activation": "linear", "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "center": true, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_2", "strides": [2], "padding": "valid", "pool_size": [2]}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"filters": 16, "strides": [1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "trainable": true, "dilation_rate": [1], "activation": "linear", "name": "conv1d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "center": true, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "name": "max_pooling1d_3", "strides": [2], "padding": "valid", "pool_size": [2]}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "bias_constraint": null}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"units": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "bias_constraint": null}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"units": 16, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_3", "bias_constraint": null}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_6", "alpha_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"units": 10, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_4", "bias_constraint": null}}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_7", "alpha_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_5", "bias_constraint": null}}], "keras_version": "2.1.3"}