{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "CuDNNLSTM", "config": {"unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 2001, 1], "return_sequences": true, "stateful": false, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "return_state": false, "go_backwards": false, "recurrent_constraint": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "cu_dnnlstm_1"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "name": "batch_normalization_1", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "center": true}}, {"class_name": "Dropout", "config": {"rate": 0.29796647089233186, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "PReLU", "config": {"alpha_regularizer": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "p_re_lu_1", "alpha_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.29796647089233186, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "PReLU", "config": {"alpha_regularizer": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "p_re_lu_2", "alpha_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"rate": 0.29796647089233186, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_3"}}, {"class_name": "PReLU", "config": {"alpha_regularizer": null, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "p_re_lu_3", "alpha_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}]}