{"backend": "tensorflow", "config": [{"config": {"name": "conv1d_218", "batch_input_shape": [null, 4000, 1], "filters": 8, "bias_constraint": null, "trainable": true, "padding": "valid", "dtype": "float32", "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_162", "gamma_regularizer": null, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling1d_121", "strides": [2], "pool_size": [2], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_518", "seed": null, "noise_shape": null, "trainable": true, "rate": 1.623235288543759e-05}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_618", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "conv1d_219", "filters": 8, "bias_constraint": null, "trainable": true, "padding": "valid", "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_163", "gamma_regularizer": null, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling1d_122", "strides": [2], "pool_size": [2], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_519", "seed": null, "noise_shape": null, "trainable": true, "rate": 1.623235288543759e-05}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_619", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "conv1d_220", "filters": 8, "bias_constraint": null, "trainable": true, "padding": "valid", "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [9], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"gamma_constraint": null, "name": "batch_normalization_164", "gamma_regularizer": null, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling1d_123", "strides": [2], "pool_size": [2], "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"name": "dropout_520", "seed": null, "noise_shape": null, "trainable": true, "rate": 1.623235288543759e-05}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_620", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "flatten_101", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_501", "bias_constraint": null, "trainable": true, "units": 32, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_521", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.1529870895215522}, "class_name": "Dropout"}, {"config": {"name": "p_re_lu_621", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "dense_502", "bias_constraint": null, "trainable": true, "units": 16, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_622", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_522", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.1529870895215522}, "class_name": "Dropout"}, {"config": {"name": "dense_503", "bias_constraint": null, "trainable": true, "units": 8, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_623", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "dropout_523", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.1529870895215522}, "class_name": "Dropout"}, {"config": {"name": "dense_504", "bias_constraint": null, "trainable": true, "units": 5, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "p_re_lu_624", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null, "alpha_constraint": null}, "class_name": "PReLU"}, {"config": {"name": "dense_505", "bias_constraint": null, "trainable": true, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential"}