{"config": [{"config": {"batch_input_shape": [null, 4000, 1], "stateful": false, "recurrent_constraint": null, "go_backwards": false, "units": 10, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false, "return_sequences": true, "recurrent_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "cu_dnnlstm_12", "activity_regularizer": null, "unit_forget_bias": true}, "class_name": "CuDNNLSTM"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_12", "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5350807190884803, "noise_shape": null, "trainable": true, "name": "dropout_12", "seed": null}, "class_name": "Dropout"}, {"config": {"stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 10, "recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false, "return_sequences": true, "recurrent_regularizer": null, "kernel_regularizer": null, "name": "cu_dnnlstm_13", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true}, "class_name": "CuDNNLSTM"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_13", "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5350807190884803, "noise_shape": null, "trainable": true, "name": "dropout_13", "seed": null}, "class_name": "Dropout"}, {"config": {"stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 10, "recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": false, "return_sequences": true, "recurrent_regularizer": null, "kernel_regularizer": null, "name": "cu_dnnlstm_14", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true}, "class_name": "CuDNNLSTM"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_14", "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5350807190884803, "noise_shape": null, "trainable": true, "name": "dropout_14", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "units": 10, "name": "dense_13", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha_constraint": null, "name": "p_re_lu_10", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"use_bias": true, "units": 5, "name": "dense_14", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha_constraint": null, "name": "p_re_lu_11", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"use_bias": true, "units": 2, "name": "dense_15", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha_constraint": null, "name": "p_re_lu_12", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "alpha_regularizer": null, "shared_axes": null}, "class_name": "PReLU"}, {"config": {"use_bias": true, "units": 1, "name": "dense_16", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "sigmoid"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}